#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_bigquery_table.logs will be created
  + resource "google_bigquery_table" "logs" {
      + creation_time       = (known after apply)
      + dataset_id          = "broad_jade_dev_datarepo_jade_audit_10001967"
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "env" = "broad-jade-dev"
        }
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = (known after apply)
      + schema              = jsonencode(
            [
              + {
                  + description = ""
                  + mode        = "NULLABLE"
                  + name        = "timestamp"
                  + type        = "TIMESTAMP"
                },
              + {
                  + description = ""
                  + mode        = "NULLABLE"
                  + name        = "user_id"
                  + type        = "STRING"
                },
              + {
                  + description = ""
                  + mode        = "NULLABLE"
                  + name        = "email"
                  + type        = "STRING"
                },
              + {
                  + description = ""
                  + mode        = "NULLABLE"
                  + name        = "status"
                  + type        = "STRING"
                },
              + {
                  + description = ""
                  + mode        = "NULLABLE"
                  + name        = "method"
                  + type        = "STRING"
                },
              + {
                  + description = ""
                  + mode        = "NULLABLE"
                  + name        = "url"
                  + type        = "STRING"
                },
            ]
        )
      + self_link           = (known after apply)
      + table_id            = "all_user_requests"
      + type                = (known after apply)

      + time_partitioning {
          + type = "DAY"
        }

      + view {
          + query          = <<~EOT
                SELECT timestamp,
                  REGEXP_EXTRACT(textPayload, r"userId: ([^,]+)") AS user_id,
                  REGEXP_EXTRACT(textPayload, r"email: ([^,]+)") AS email,
                  REGEXP_EXTRACT(textPayload, r"status: ([^,]+)") AS status,
                  REGEXP_EXTRACT(textPayload, r"method: ([^,]+)") AS method,
                  REGEXP_EXTRACT(textPayload, r"url: ([^,]+)") AS url
                FROM `broad-jade-dev.broad_jade_dev_datarepo_jade_audit_10001967.stdout_*`;
            EOT
          + use_legacy_sql = false
        }
    }

  # google_project_iam_member.jade-api-sa-roles["roles/bigquery.admin"] will be created
  + resource "google_project_iam_member" "jade-api-sa-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:jade-api-sa@broad-jade-dev.iam.gserviceaccount.com"
      + project = "broad-jade-dev"
      + role    = "roles/bigquery.admin"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Quoted references are deprecated

  on .terraform/modules/dns-set/terraform-modules/external-dns/dns.tf line 6, in data "google_dns_managed_zone" "dns_zone":
   6:     provider     = "google.targetdns"

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

(and 3 more similar warnings elsewhere)

```

</details>

*Workflow: `Terraform GitHub Actions to validate/plan TF files`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
